# Програма що перевіряє чи задане число користувачем є простим
# Список простих чисел до 100
prime_set = {2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97}


# Основна функція программи, якщо число просте, то повертає True, якщо навпаки то False
def function(number):
    if number in prime_set:
        return True
    else:
        return False


if __name__ == '__main__':
    while True:
        try:
            # Запрос до користувача і функціі
            number = int(input("Введіть число для перевірки його: "))
            # Виведення результату на екран
            print(function(number))
            exit()
        # Виводить на екран якщо користувач не ввів число (int)
        except Exception:
            print("Введите число:")
