# Програма для розрахування периметру та площі трикутника по заданим сторонам користувача
# імпорт функції sqrt з модулю math для піднесення до степені і пошуку площі трикутника
from math import sqrt


# Основна функція програми
def sides_tringle(a, b, c) -> int:
    # Умова для визначення чи є сторони плюсові
    if a > 0 and b > 0 and c > 0:
        # Умова для визначення правдивості трикутника
        if a + b > c and b + c > a and a + c > b:
            # Формула периметра
            p = a + b + c
            # Формула площі
            half_p = p / 2
            s = sqrt(half_p * (half_p - a) * (half_p - b) * (half_p - c))
            return p, s


if __name__ == '__main__':
    #Цикл для помилки
    while True:
        # Цикл для основної програми
        try:
            a = int(input("Введіть першу сторону трикутника: "))
            b = int(input("Введіть другу сторону трикутника: "))
            c = int(input("Введіть третю сторону трикутника: "))
            p, s = sides_tringle(a, b, c)
            print(f"Периметр трикутника: {p}\nПлоща трикутника: {round(s, 2)}")
            exit()
        # Відлов помилки якщо введені дані користувачем неє int
        except ValueError:
            print("Некоректне значення (not int)")
        # Відлов помилки якщо трикутник неє справжнім (None)
        except TypeError:
            print("Такого трикутника не існує")
