        #Бот чат для діалогу
# змінна для виходу з коду
exit1 = "exit"
# змінна для ошибки
error = "Дуже цікаво, але, на жаль, нічого не зрозуміло :("
                    #Цикл про Вітання
hello1 = "хай"
hello2 = "доброго вечора"
hello3 = "привіт"
print(f"Доступні команди: {hello1.title()}, {hello2.title()},{hello3.title()}")
print("Для виходу з будь якої строки - напишіть \"exit\": ")
while True:
    hello = input().lower()
    if hello == hello1 or hello == hello2 or hello == hello3:
        print("Доброго вечора, я бот з України!")
        break
    if hello == exit1:
        exit()
    else:
        print(error)

                      #Цикл про зайнятість

working1 = "як справи?"
working2 = "що робиш?"
working3 = "чим займаєшся?"
print(f"Доступні команди: {working1.title()}, {working2.title()},{working3.title()}: ")
while True:
    working = input().lower()
    if working == working1 or working == working2 or working == working3:
        print("Вчусь програмувати на Python!")
        break
    if working == exit1:
        exit()
    else:
        print(error)

                    #Цикл про фільми

tv1 = "фільм"
tv2 = "кінотеатр"
tv3 = "серіал"
film = "Гра престолів"
print(f"Доступні команди: {tv1.title()}, {tv2.title()},{tv3.title()}: ")
while True:
    tv = input().lower()
    if tv == tv1 or tv == tv2 or tv == tv3:
        x1 = "так"
        x2 = "ні"
        x = input(f"Соррі що втручуюсь, не знаю про що йдеться мова,\nале подивіться серіал {film} він просто бомба!"
                  f"\nХочете дізнатись про нього більше?:\n Доступні команди: {x1.title()}, {x2.title()}: ")

            #Додатковий цикл з описуванням данного серіалу

        if x.lower() == x2.lower():
            break
        text = """
"Гра престолів" — це популярний американський телевізійний серіал, створений за мотивами серії романів "Пісня Льоду і Вогню" Джорджа Р. Р. Мартина. Серіал пройшов з 2011 по 2019 рік і складається з восьми сезонів.
Сюжет розгортається в фантастичному світі, відомому як Вестерос, де кілька благородних родин змагаються за трон Залізного трону. У серіалі змальовано складні політичні інтриги, боротьбу за владу, війни, фентезійні елементи та долю численних персонажів.
Серіал став відомим своєю непередбачуваністю та шокуючими поворотами сюжету, а також вражаючими битвами та високоякісною зйомкою. "Гра престолів" отримала величезну популярність серед глядачів та зібрала високі оцінки критиків. Завершення серіалу стало предметом обговорень та розділило думки шанувальників."""

        if x.lower() == x1.lower():
            print(text)
            break
        if x.lower() == exit1:
            exit()
        else:
            print(error)
    if tv == exit1:
        exit()
    else:
        print(error)

                    #Цикл з прощанням

bye1 = "бувай"
bye2 = "надобраніч"
bye3 = "гудбай"
bye4 = "до зустрічі"
print(f"Доступні команди: {bye1.title()}, {bye2.title()}, {bye3.title()}, {bye4.title()}: ")
while True:
    bye = input().lower()
    if bye == bye1 or bye == bye2 or bye == bye3:
        print("Побачимось у мережі, I'll be back.!")
        exit()
    else:
        print(error)