        #Бот чат для діалогу
# змінна для ошибки
error = "Дуже цікаво, але, на жаль, нічого не зрозуміло :("

#Цикл про Вітання
print("Доступні команди: Хай, Доброго вечора, Привіт ")
print("Для виходу з будь якої строки - напишіть \"exit\": ")

while True:
    hello = input().lower()
    if "хай" in hello or "доброго вечора" in hello or "привіт" in hello:
        print("Доброго вечора, я бот з України!")
        break
    if hello == "exit":
        exit()
    else:
        print(error)

#Цикл про зайнятість
print("Доступні команди: Як справи?, Що робиш?, Чим займаєшся? ")

while True:
    working = input().lower()
    if "як справи?" in working or "що робиш?" in working or "чим займаєшся?" in working:
        print("Вчусь програмувати на Python!")
        break
    if working == "exit":
        exit()
    else:
        print(error)

#Цикл про фільми
print(f"Доступні команди: Фільм, Кінотеатр, Серіал")

while True:
    tv = input().lower()
    if "фільм" in tv or "кінотеатр" in tv or "Серіал" in tv:
        x = input(f"Соррі що втручуюсь, не знаю про що йдеться мова,\nале подивіться серіал Гра Престолів він просто бомба!"
                  f"\nХочете дізнатись про нього більше?:\n Доступні команди: Так, Ні: ")

        #Додатковий цикл з описуванням данного серіалу
        if "ні" in x.lower():
            break

        #Текст для кода
        text = """
        "Гра престолів" — це популярний американський телевізійний серіал, створений за мотивами серії романів
        "Пісня Льоду і Вогню" Джорджа Р. Р. Мартина. Серіал пройшов з 2011 по 2019 рік і складається з восьми сезонів.
        Сюжет розгортається в фантастичному світі, відомому як Вестерос, де кілька благородних родин змагаються за трон Залізного трону.
        У серіалі змальовано складні політичні інтриги, боротьбу за владу, війни, фентезійні елементи та долю численних персонажів.
        Серіал став відомим своєю непередбачуваністю та шокуючими поворотами сюжету, а також вражаючими битвами та високоякісною зйомкою.
        "Гра престолів" отримала величезну популярність серед глядачів та зібрала високі оцінки критиків.
        Завершення серіалу стало предметом обговорень та розділило думки шанувальників.
        """
        if "так" in x.lower() :
            print(text)
            break
        if x.lower() == "exit":
            exit()
        else:
            print(error)
    if tv == "exit":
        exit()
    else:
        print(error)

#Цикл з прощанням
print("Доступні команди: Бувай, Надобраніч, Гудбай, До зустрічі: ")
while True:
    bye = input().lower()
    if "надобраніч" in bye or "бувай" in bye or "гудбай" in bye or "До зустрічі" in bye:
        print("Побачимось у мережі, I'll be back.!")
        exit()
    else:
        print(error)